"""
Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
"""

while True:
    num = int(input("Введите трёхзначное число (0 - закончить): "))
    if num == 0:
        break
    elif num >= 100 and num < 1000:
        num100 = num // 100
        num10 = num % 100 // 10
        num1 = num % 10
        print("Сумма цифр трёхзначного числа:")
        print(f"{num} -> {num100 + num10 + num1} ({num100} + {num10} + {num1})")
